<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 会话设置
// +----------------------------------------------------------------------

return [
//
    'session_type'=> 'redis',
    'prefix'     => 'module',
    'auto_start' => true,
    // redis主机
    'host'       => '120.77.154.221',
    // redis端口
    'port'       => 6379,
    // 密码
    'password'   => 'qy12345.',
//    'id'             => '',
//    // SESSION_ID的提交变量,解决flash上传跨域
//    'var_session_id' => '',
//    // SESSION 前缀
//    'prefix'         => 'think',
//    // 驱动方式 支持redis memcache memcached
//    'type'           => '',
//    // 是否自动开启 SESSION
//    'auto_start'     => true,
//    // SESSION 存在时间 半小时
//    'expire' => 1800,
];
